caAERS/software/jbi/caaers2adeers-sync/core-camel-su/src/test/resources/xslt/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <com:createOrUpdateASAEL xmlns:com="http://schema.integration.caaers.cabig.nci.nih.gov/common" xmlns:asa="http://schema.integration.caaers.cabig.nci.nih.gov/asael">
            <com:asael>
                <asa:asaelAgent>
                    <com:agent>
                        <name>RO4929097</name>
                        <nscNumber>749225</nscNumber>
                    </com:agent>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Diarrhea</ctepTerm>
                        <category>Gastrointestinal disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Nausea</ctepTerm>
                        <category>Gastrointestinal disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Vomiting</ctepTerm>
                        <category>Gastrointestinal disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Fatigue</ctepTerm>
                        <category>General disorders and administration site conditions</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Anorexia</ctepTerm>
                        <category>Metabolism and nutrition disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Hypophosphatemia</ctepTerm>
                        <category>Metabolism and nutrition disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Headache</ctepTerm>
                        <category>Nervous system disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Pruritus</ctepTerm>
                        <category>Skin and subcutaneous tissue disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Rash maculo-papular</ctepTerm>
                        <category>Skin and subcutaneous tissue disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <status>Active</status>
                </asa:asaelAgent>
                <asa:asaelAgent>
                    <com:agent>
                        <name>GDC-0449</name>
                        <nscNumber>747691</nscNumber>
                    </com:agent>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Fatigue</ctepTerm>
                        <category>General disorders and administration site conditions</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Anorexia</ctepTerm>
                        <category>Metabolism and nutrition disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Musculoskeletal and connective tissue disorder -  Other, specify</ctepTerm>
                        <category>Musculoskeletal and connective tissue disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Dysgeusia</ctepTerm>
                        <category>Nervous system disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <asa:expectedAECtcTerm>
                        <ctepTerm>Alopecia</ctepTerm>
                        <category>Skin and subcutaneous tissue disorders</category>
                        <ctcVersion>4</ctcVersion>
                        <status>Active</status>
                    </asa:expectedAECtcTerm>
                    <status>Active</status>
                </asa:asaelAgent>
            </com:asael>
        </com:createOrUpdateASAEL>
    </soapenv:Body>
</soapenv:Envelope>
